rpi5-32/20240801-0812-glibc-tuned/logs/pgbench-no-1024-32768-10/pgbench.log
pgbench (18devel)
transaction type: <builtin: select only>
scaling factor: 1
partition method: range
partitions: 10
query mode: prepared
number of clients: 8
number of threads: 8
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 410601
number of failed transactions: 0 (0.000%)
latency average = 0.195 ms
initial connection time = 9.379 ms
tps = 41088.126211 (without initial connection time)